Repository: 42school/norminette
Catalog: norminette/locale/*/LC_MESSAGES/norminette.po
Languages: pt_br

source: Spaces at beginning of line
pt_br: Espaços no começo da linha

source: Found tab when expecting space
pt_br: Encontrado tabulação ao invés espaço

source: Two or more consecutives spaces
pt_br: Dois ou mais espaços consecutivos

source: Two or more consecutives white spaces
pt_br: Dois ou mais espaços em branco consecutivos

source: missing space before operator
pt_br: Faltando espaço antes do operador

source: missing space after operator
pt_br: Faltando espaço após o operador

source: extra space before operator
pt_br: Espaço a mais antes do operador

source: extra space after operator
pt_br: Espaço a mais depois do operador

source: Missing space after parenthesis (brace/bracket)
pt_br: Faltando espaço após parêntese (chave/colchete)

source: Missing space before parenthesis (brace/bracket)
pt_br: Faltando espaço antes de parêntese (chave/colchete)

source: Extra space after parenthesis (brace/bracket)
pt_br: Espaço extra após parêntese (chave/colchete)

source: Extra space before parenthesis (brace/bracket)
pt_br: Espaço extra antes de parêntese (chave/colchete)

source: space after pointer
pt_br: Espaço após ponteiro

source: Unexpected space/tab at line start
pt_br: Espaço/tabulação inesperado no início da linha

source: bad spacing before pointer
pt_br: Espaçamento incorreto antes do ponteiro

source: space before function name
pt_br: Espaço antes do nome da função

source: extra tabs before function name
pt_br: Tabulações extras antes do nome da função

source: extra tabs before typedef name
pt_br: Tabulações extras antes do nome do typedef

source: missing tab before function name
pt_br: Faltando tabulação antes do nome da função

source: missing tab before variable name
pt_br: Faltando tabulação antes do nome da variável

source: Missing tab before typedef name
pt_br: Faltando tabulação antes do nome do typedef

source: extra tab before variable name
pt_br: Tabulação extra antes do nome da variável

source: line too long
pt_br: Linha muito longa

source: Expected parenthesis
pt_br: Parêntese esperado

source: missing type qualifier or identifier in function arguments
pt_br: Faltando qualificador de tipo ou identificador nos argumentos da função

source: user defined identifiers should contain only lowercase characters, digits or '_'
pt_br: Identificadores definidos pelo usuário devem conter apenas letras minúsculas, dígitos ou '_'

source: Missing tabs for indent level
pt_br: Faltando tabulações para o nível de indentação

source: Extra tabs for indent level
pt_br: Tabulações extras para o nível de indentação

source: Extra whitespaces for indent level
pt_br: Espaços extras para o nível de indentação

source: Found space when expecting tab
pt_br: Espaço encontrado onde era esperado tabulação

source: Function has more than 25 lines
pt_br: A função tem mais de 25 linhas

source: Space on empty line
pt_br: Espaço em linha vazia

source: Space before newline
pt_br: Espaço antes da nova linha

source: Too many instructions on a single line
pt_br: Muitas instruções em uma única linha

source: Missing space after preprocessor directive
pt_br: Faltando espaço após a diretiva do pré-processador

source: Unrecognized preprocessor statement
pt_br: Declaração de pré-processador não reconhecida

source: Preprocessor statement not at the beginning of the line
pt_br: Declaração de pré-processador não está no início da linha

source: Preprocessor statement must only contain constant defines
pt_br: Declaração de pré-processador deve conter apenas constantes definidas

source: Expected EOL after preprocessor statement
pt_br: Esperado fim de linha após a declaração do pré-processador

source: If preprocessor statement without endif
pt_br: Declaração de pré-processador 'if' sem 'endif'

source: Elif preprocessor statement without if or elif
pt_br: Declaração de pré-processador 'elif' sem 'if' ou 'elif'

source: Ifdef preprocessor statement without endif
pt_br: Declaração de pré-processador 'ifdef' sem 'endif'

source: Ifndef preprocessor statement without endif
pt_br: Declaração de pré-processador 'ifndef' sem 'endif'

source: Else preprocessor statement without if or elif
pt_br: Declaração de pré-processador 'else' sem 'if' ou 'elif'

source: Endif preprocessor statement without if, elif or else
pt_br: Declaração de pré-processador 'endif' sem 'if', 'elif' ou 'else'

source: Bad preprocessor indentation
pt_br: Indentação incorreta no pré-processador

source: Multiline preprocessor statement is forbidden
pt_br: Declaração de pré-processador em múltiplas linhas é proibida

source: Preprocessor statements are only allowed in the global scope
pt_br: Declarações de pré-processador são permitidas apenas no escopo global

source: User defined typedef must start with t_
pt_br: Typedef definido pelo usuário deve começar com t_

source: Structure name must start with s_
pt_br: Nome da estrutura deve começar com s_

source: Enum name must start with e_
pt_br: Nome do enum deve começar com e_

source: Union name must start with u_
pt_br: Nome da união deve começar com u_

source: Global variable must start with g_
pt_br: Variável global deve começar com g_

source: Missing whitespace before typedef name
pt_br: Espaço em branco faltando antes do nome do typedef

source: Global variable present in file. Make sure it is a reasonable choice.
pt_br: Variável global presente no arquivo. Certifique-se de que é uma escolha razoável.

source: Logic operator at the end of line
pt_br: Operador lógico no final da linha

source: Empty line in function
pt_br: Linha vazia dentro da função

source: Empty line at start of file
pt_br: Linha vazia no início do arquivo

source: Empty line at end of file
pt_br: Linha vazia no final do arquivo

source: Variable declared in incorrect scope
pt_br: Variável declarada no escopo incorreto

source: Missing type in variable declaration
pt_br: Faltando tipo na declaração da variável

source: Variable declaration not at start of function
pt_br: Declaração de variável não está no início da função

source: Too many variables declarations in a function
pt_br: Muitas declarações de variáveis em uma função

source: Too many functions in file
pt_br: Muitas funções no arquivo

source: Expected newline after brace
pt_br: Esperada nova linha após a chave

source: Consecutive newlines
pt_br: Novas linhas consecutivas

source: Functions must be separated by a newline
pt_br: Funções devem ser separadas por uma linha em branco

source: Variable declarations must be followed by a newline
pt_br: Declarações de variáveis devem ser seguidas por uma nova linha

source: Preprocessor statement must be followed by a newline
pt_br: Declaração de pré-processador deve ser seguida por uma nova linha

source: Multiple assignations on a single line
pt_br: Múltiplas atribuições em uma única linha

source: Multiple declarations on a single line
pt_br: Múltiplas declarações em uma única linha

source: Declaration and assignation on a single line
pt_br: Declaração e atribuição na mesma linha

source: Forbidden control structure
pt_br: Estrutura de controle proibida

source: Missing space after keyword
pt_br: Faltando espaço após a palavra-chave

source: Expected semicolon
pt_br: Esperado ponto e vírgula

source: Expected tab
pt_br: Tabulação esperada

source: Empty function argument requires void
pt_br: Argumento de função vazio requer void

source: Misaligned variable declaration
pt_br: Declaração de variável desalinhada

source: Misaligned function declaration
pt_br: Declaração de função desalinhada

source: Comment is invalid in this scope
pt_br: Comentário inválido neste escopo

source: Macro name must be capitalized
pt_br: Nome de macro deve estar em letras maiúsculas

source: Macro functions are forbidden
pt_br: Funções de macro são proibidas

source: Assignment in control structure
pt_br: Atribuição dentro de estrutura de controle

source: Variable length array forbidden
pt_br: Arrays de tamanho variável são proibidos

source: Function has more than 4 arguments
pt_br: A função possui mais de 4 argumentos

source: .c file includes are forbidden
pt_br: Inclusões de arquivos .c são proibidas

source: Include must be at the start of file
pt_br: Instruções de include devem estar no início do arquivo

source: Header protection must include all the instructions
pt_br: A proteção de cabeçalho deve englobar todas as instruções

source: Instructions after header protection are forbidden
pt_br: Instruções após a proteção de cabeçalho são proibidas

source: Wrong header protection name
pt_br: Nome da proteção de cabeçalho incorreto

source: Header protection must be in uppercase
pt_br: A proteção de cabeçalho deve estar em letras maiúsculas

source: Multiple header protections, only one is allowed
pt_br: Múltiplas proteções de cabeçalho — apenas uma é permitida

source: Header protection not containing #define
pt_br: Proteção de cabeçalho não contém #define

source: Ternaries are forbidden
pt_br: Operadores ternários são proibidos

source: Too many values on define
pt_br: Muitos valores em uma diretiva define

source: Newline in declaration
pt_br: Nova linha na declaração

source: Multiple instructions in single line control structure
pt_br: Múltiplas instruções em uma única linha de estrutura de controle

source: Newline in define
pt_br: Nova linha em uma diretiva define

source: Missing identifier in typedef declaration
pt_br: Identificador ausente na declaração de typedef

source: Label statements are forbidden
pt_br: Declarações de rótulo (label) são proibidas

source: Goto statements are forbidden
pt_br: Declarações goto são proibidas

source: Preprocessors can only be used in the global scope
pt_br: Pré-processadores só podem ser usados no escopo global

source: Function prototype in incorrect scope
pt_br: Protótipo de função em escopo incorreto

source: Statement is in incorrect scope
pt_br: Instrução está em escopo incorreto

source: Incorrect values in define
pt_br: Valores incorretos em uma diretiva define

source: Expected newline before brace
pt_br: Esperada nova linha antes da chave

source: Expected newline after control structure
pt_br: Esperada nova linha após a estrutura de controle

source: Unrecognized variable type
pt_br: Tipo de variável não reconhecido

source: Comment must be on its own line or at end of a line
pt_br: Comentário deve estar em sua própria linha ou ao fim de uma linha

source: Comma at line start
pt_br: Vírgula no início da linha

source: Mixed spaces and tabs
pt_br: Mistura de espaços e tabulações

source: Function attribute must be at the end of line
pt_br: Atributo da função deve estar no final da linha

source: Missing or invalid 42 header
pt_br: Cabeçalho 42 ausente ou inválido

source: Missing space between include and filename
pt_br: Faltando espaço entre include e nome do arquivo

source: Enums, structs and unions need to be defined only in global scope
pt_br: Enums, structs e unions devem ser definidos apenas no escopo global

source: Typedef declaration are not allowed in .c files
pt_br: Declarações typedef não são permitidas em arquivos .c

source: Struct declaration are not allowed in .c files
pt_br: Declarações struct não são permitidas em arquivos .c

source: Union declaration are not allowed in .c files
pt_br: Declarações union não são permitidas em arquivos .c

source: Enum declaration are not allowed in .c files
pt_br: Declarações enum não são permitidas em arquivos .c

source: Unexpected end of file (EOF) while parsing a char
pt_br: Fim de arquivo inesperado (EOF) ao analisar um caractere

source: Unexpected end of line (EOL) while parsing a char
pt_br: Fim de linha inesperado (EOL) ao analisar um caractere

source: Unexpected end of file (EOF) while parsing a multiline comment
pt_br: Fim de arquivo inesperado (EOF) ao analisar um comentário multilinha

source: Unexpected end of file (EOF) while parsing a string
pt_br: Fim de arquivo inesperado (EOF) ao analisar uma string

source: Empty character constant
pt_br: Constante de caractere vazia

source: Character constants can have only one character
pt_br: Constantes de caractere devem conter apenas um caractere

source: This suffix is invalid
pt_br: Esse sufixo é inválido

source: Invalid suffix for float/double literal constant
pt_br: Sufixo inválido para constante literal float/double

source: Invalid binary integer literal
pt_br: Literal inteiro binário inválido

source: Invalid octal integer literal
pt_br: Literal inteiro octal inválido

source: Invalid hexadecimal integer literal
pt_br: Literal inteiro hexadecimal inválido

source: Potential maximal munch detected
pt_br: Possível ocorrência de 'maximal munch' detectada

source: No hexadecimal digits followed by the \x
pt_br: Nenhum dígito hexadecimal após o \x

source: Unknown escape sequence
pt_br: Sequência de escape desconhecida

source: Exponent has no digits
pt_br: Expoente sem dígitos

source: Multiple dots in float constant
pt_br: Múltiplos pontos em constante float

source: Multiple 'x' in hexadecimal float constant
pt_br: Múltiplos 'x' em constante float hexadecimal
